app/controllers/settings_controller.rb

SELECT "settings".* FROM "settings"
---
  def index
    @settings = Setting.all

SELECT "settings".* FROM "settings" WHERE "settings"."id" = 1 LIMIT 1
---
  def show
    @setting = Setting.find params[:id]

INSERT INTO "settings" ("name", "serialized_value", "created_at", "updated_at") VALUES ('setting_name', NULL, '2011-08-08 18:28:38.745057', '2011-08-08 18:28:38.745057')
---
  def create
    @setting = Setting.new params[:setting]
    if @setting.save

SELECT "settings".* FROM "settings" WHERE "settings"."id" = 1 LIMIT 1
---
  def edit
    @setting = Setting.find params[:id]

SELECT "settings".* FROM "settings" WHERE "settings"."id" = 1 LIMIT 1
UPDATE "settings" SET "name" = 't2', "serialized_value" = '--- ''1''
---
  def update
    @setting = Setting.find params[:id]
    if @setting.update_attributes params[:setting]